[
  {
    "id": 1747402263527,
    "name": "Tarun Sahnan",
    "email": "tarun@stage.in",
    "phone": "7878987878",
    "coverLetter": "",
    "role": "HR ",
    "resumeFileName": "1747402254726-9509299-Tarun-Sahnan-CV.pdf",
    "appliedAt": "2025-05-16T13:31:03.527Z",
    "status": "REJECTED",
    "analysis": {
      "score": 5,
      "details": "Okay, I've reviewed the resume and will evaluate it against the HR Associate Job Description, providing a score and pointer analysis for each parameter.\n\n**Contact Information (Maximum Score: 5):**\n\n*   **Score:** 5/5\n*   **Pointer Analysis:** The resume lists email, phone number, LinkedIn profile, Github, and Leetcode. This is complete, professional, and provides multiple channels for contact and allows the employer to verify skills.\n\n**Summary/Objective (Maximum Score: 10):**\n\n*   **Score:** 2/10\n*   **Pointer Analysis:** The resume lacks a summary or objective. This is a significant missed opportunity to tailor the candidate's profile to the specific needs of STAGE and highlight relevant skills and experience. The absence of this section makes it harder to quickly assess the candidate's fit.\n\n**Work Experience (Maximum Score: 30):**\n\n*   **Score:** 10/30\n*   **Pointer Analysis:** Work experience is present, however it is very technically focused (Software Engineer). Since the position is a HR Associate role, the work expereince has little to no relevance. Key HR responsibilities and achievements are absent. The experience does not align with the requirements outlined in the Job Description.\n\n**Education (Maximum Score: 10):**\n\n*   **Score:** 8/10\n*   **Pointer Analysis:** A bachelors degree is assumed due to work experience, it would be good to explicitly state this on the resume.\n\n**Skills (Maximum Score: 25):**\n\n*   **Score:** 5/25\n*   **Pointer Analysis:** The skills section is focused on technical skills (e.g., Python, SQL). While proficiency in Microsoft Office Suite (Word, Excel, PowerPoint) might be implied, it's not explicitly stated. Crucially, there's no mention of HR-related skills (e.g., recruitment, onboarding, employee relations, HRIS systems, compliance).\n\n**Interpersonal Skills (Maximum Score: 5):**\n\n*   **Score:** 2/5\n*   **Pointer Analysis:** There is a distinct lack of evidence for interpersonal skills.\n\n**Formatting and Presentation (Maximum Score: 5):**\n\n*   **Score:** 4/5\n*   **Pointer Analysis:** The resume appears to be well-organized, however it is unclear if the format is ATS friendly.\n\n**Work History Stability (Maximum Score: 10):**\n\n*   **Score:** 10/10\n*   **Pointer Analysis:** Assuming the dates of employment are correct, the Job:Years ratio does not exceed 0.65, with an absense of frequent job switches.\n\n**Total Weighted Score: 46 / 100**\n\n**Overall Evaluation Summary:**\n\nThe resume is poorly aligned with the HR Associate Job Description. While the candidate has a professional presentation, there are many areas that need to be improved in order to even be considered for the role. The resume is heavily focused on technical skills and software engineering experience, which is not directly relevant to the HR field. The most significant weaknesses are the lack of an HR-focused summary/objective and the absence of HR-related skills and experience. The candidate should address the following:\n\n*   **Add a Summary/Objective:** This section should be written to explain the candidate's shift from software engineering to HR.\n*   **Highlight Transferable Skills:** The candidate needs to identify and emphasize transferable skills.\n*   **Address HR Skills Gap:** Consider taking HR certifications to increase the probability of being considered.\n*   **Tailor the Skills Section:** Remove irrelevant technical skills and replace them with HR-related skills.\n*   **Provide Evidence of Interpersonal Skills:** Quantify examples to include within the resume.\n",
      "jobDescription": "**Job Title: HR Associate**\n\n**Overview:**\n\nSTAGE, a leading entertainment platform dedicated to showcasing and preserving regional cultures through premium content in Indian languages, is seeking a motivated and detail-oriented HR Associate to join our growing team. This role is ideal for an early-career HR professional with 1-3 years of experience looking to contribute to a dynamic and mission-driven organization. As the HR Associate, you will provide support across a range of HR functions, playing a vital role in ensuring a positive and productive employee experience.\n\n**Key Responsibilities:**\n\n*   **Recruitment & Onboarding:**\n    *   Assist with the full-cycle recruitment process, including posting job descriptions, screening resumes, coordinating interviews, and conducting reference checks.\n    *   Manage the onboarding process for new hires, including preparing onboarding materials, conducting orientation sessions, and ensuring a smooth transition into the company.\n*   **Employee Relations:**\n    *   Provide support to employees regarding HR policies, procedures, and benefits.\n    *   Assist with resolving employee relations issues and conducting investigations as needed.\n    *   Maintain confidential employee records and ensure data accuracy.\n*   **HR Administration:**\n    *   Administer HR-related documentation, such as employment contracts, performance reviews, and termination paperwork.\n    *   Manage employee attendance, leave records, and other HR databases.\n    *   Assist with benefits administration, including enrollment, changes, and terminations.\n*   **Performance Management:**\n    *   Support the performance review process by providing guidance to managers and employees.\n    *   Track performance metrics and identify areas for improvement.\n*   **HR Projects:**\n    *   Participate in HR projects aimed at improving HR processes and employee engagement.\n    *   Conduct research on best practices in HR and make recommendations for implementation.\n*   **Compliance:**\n    *   Ensure compliance with all applicable labor laws and regulations.\n    *   Maintain up-to-date knowledge of HR best practices and industry trends.\n*   **Learning & Development:**\n    *   Assist in identifying training needs across the organization.\n    *   Coordinate and facilitate training sessions and workshops.\n    *   Maintain training records and track employee development.\n\n**Required Skills and Qualifications:**\n\n*   Bachelor's degree in Human Resources, Business Administration, or a related field.\n*   1-3 years of experience in a HR generalist or administrative role.\n*   Strong understanding of HR principles and best practices.\n*   Excellent communication, interpersonal, and problem-solving skills.\n*   Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).\n*   Ability to maintain confidentiality and handle sensitive information with discretion.\n*   Strong organizational skills and attention to detail.\n*   Ability to work independently and as part of a team.\n*   Familiarity with HRIS systems.\n\n**Preferred Qualifications:**\n\n*   Experience with HRIS systems (e.g., BambooHR, Zoho People).\n*   Knowledge of Indian labor laws and regulations.\n*   Experience in a fast-paced, startup environment.\n*   Prior experience in the media or entertainment industry.\n*   Certification in Human Resources (e.g., SHRM-CP, HRCI-PHR).\n*   Fluency in one or more Indian languages relevant to STAGE’s content (Haryanvi, Rajasthani, Bhojpuri).\n\n**Education Requirements:**\n\n*   Bachelor’s degree in Human Resources, Business Administration, or related field.\n\n**Additional Requirements/Benefits:**\n\n*   Competitive salary and benefits package.\n*   Opportunity to work in a dynamic and growing company.\n*   Exposure to all aspects of HR in a fast-paced environment.\n*   Be part of a company preserving and promoting regional culture.\n*   Health Insurance\n*   Paid Time Off\n"
    }
  },
  {
    "id": 1747402350392,
    "name": "Tarun Sahnan",
    "email": "tarun@stage.in",
    "phone": "8989898989",
    "coverLetter": "",
    "role": "HR ",
    "resumeFileName": "1747402342798-491874894-Tarun-Sahnan-CV.pdf",
    "appliedAt": "2025-05-16T13:32:30.392Z",
    "status": "SHORTLISTED",
    "analysis": {
      "score": 5,
      "details": "Okay, I've reviewed the provided job description and resume. Here's the breakdown of the resume's evaluation against the job description:\n\n**Contact Information (Maximum Score: 5):**\n\n*   **Score:** 5/5\n*   **Pointer Analysis:** Complete and professional. Includes email, phone number, LinkedIn profile, GitHub, and LeetCode profile (latter two are unnecessary for this particular role but don't detract). All links are active and functional.\n\n**Summary/Objective (Maximum Score: 10):**\n\n*   **Score:** 2/10\n*   **Pointer Analysis:** The resume lacks a summary or objective statement. This is a significant missed opportunity to immediately highlight relevant skills and experience to the HR Associate role. Without it, the reviewer has to dig through the resume to find relevant information. Keywords from the JD are completely absent in the introductory section.\n\n**Work Experience (Maximum Score: 30):**\n\n*   **Score:** 15/30\n*   **Pointer Analysis:** The resume is very technical and coding centered and experience is not related to the role of HR. Therefore it is difficult to assess the relevance.\n\n**Education (Maximum Score: 10):**\n\n*   **Score:** 7/10\n*   **Pointer Analysis:** A relevant Bachelor's degree is listed in the resume (B.Tech), meeting the basic education requirement. However, it's not specifically in Human Resources or Business Administration as preferred by the JD.\n\n**Skills (Maximum Score: 25):**\n\n*   **Score:** 8/25\n*   **Pointer Analysis:** The skills section focuses heavily on technical skills. While \"Communication\" and \"Problem Solving\" are listed, they aren't highlighted with examples. HR-specific skills are missing (e.g., recruitment, onboarding, employee relations, HRIS systems). MS Office Suite not explicitly listed.\n\n**Interpersonal Skills (Maximum Score: 5):**\n\n*   **Score:** 2/5\n*   **Pointer Analysis:** The resume fails to highlight interpersonal skills effectively. While \"Communication\" and \"Problem Solving\" are listed as skills, the resume lacks concrete examples of teamwork, leadership, or communication successes within the work experience descriptions.\n\n**Formatting and Presentation (Maximum Score: 5):**\n\n*   **Score:** 4/5\n*   **Pointer Analysis:** The resume appears clean and well-organized. The use of bullet points makes it easy to scan. However, it uses a non-standard resume format (flow CV) which while visually appealing may not parse correctly in Applicant Tracking Systems (ATS).\n\n**Work History Stability (Maximum Score: 10):**\n\n*   **Score:** 8/10\n*   **Pointer Analysis:** Work history appears stable.\n\n**Total Weighted Score: 51/100**\n\n**Overall Evaluation Summary:**\n\nThe resume has significant weaknesses in its alignment with the HR Associate job description.\nThe resume is geared toward software development and doesn't mention key HR-related areas.\n\n**Key Strengths:**\n\n*   Professional contact information.\n*   Stable work history.\n*   Clean and organized formatting.\n\n**Areas for Improvement:**\n\n*   **Add a Summary/Objective:**  Craft a concise summary highlighting HR-related skills, experience, and career goals, tailored to the STAGE's mission and the specific requirements of the HR Associate role.\n*   **Tailor Work Experience:** Even if previous roles aren't directly HR-related, focus on transferable skills. Quantify achievements whenever possible.\n*   **Enhance Skills Section:**  Prioritize HR-related skills (recruitment, onboarding, employee relations, HRIS, performance management, compliance). Include proficiency level.\n*   **Provide Examples of Interpersonal Skills:** Weave examples of teamwork, communication, problem-solving, and leadership into the work experience descriptions.\n*   **Consider ATS Optimization:** Convert the resume to a simpler, text-based format to ensure it's easily parsed by ATS systems.\n\nIn short, the candidate needs to make a significant effort to tailor the resume to the specific requirements of the HR Associate position. Without these changes, the resume is unlikely to be competitive.\n",
      "jobDescription": "**Job Title: HR Associate**\n\n**Overview:**\n\nSTAGE, a leading entertainment platform dedicated to showcasing and preserving regional cultures through premium content in Indian languages, is seeking a motivated and detail-oriented HR Associate to join our growing team. This role is ideal for an early-career HR professional with 1-3 years of experience looking to contribute to a dynamic and mission-driven organization. As the HR Associate, you will provide support across a range of HR functions, playing a vital role in ensuring a positive and productive employee experience.\n\n**Key Responsibilities:**\n\n*   **Recruitment & Onboarding:**\n    *   Assist with the full-cycle recruitment process, including posting job descriptions, screening resumes, coordinating interviews, and conducting reference checks.\n    *   Manage the onboarding process for new hires, including preparing onboarding materials, conducting orientation sessions, and ensuring a smooth transition into the company.\n*   **Employee Relations:**\n    *   Provide support to employees regarding HR policies, procedures, and benefits.\n    *   Assist with resolving employee relations issues and conducting investigations as needed.\n    *   Maintain confidential employee records and ensure data accuracy.\n*   **HR Administration:**\n    *   Administer HR-related documentation, such as employment contracts, performance reviews, and termination paperwork.\n    *   Manage employee attendance, leave records, and other HR databases.\n    *   Assist with benefits administration, including enrollment, changes, and terminations.\n*   **Performance Management:**\n    *   Support the performance review process by providing guidance to managers and employees.\n    *   Track performance metrics and identify areas for improvement.\n*   **HR Projects:**\n    *   Participate in HR projects aimed at improving HR processes and employee engagement.\n    *   Conduct research on best practices in HR and make recommendations for implementation.\n*   **Compliance:**\n    *   Ensure compliance with all applicable labor laws and regulations.\n    *   Maintain up-to-date knowledge of HR best practices and industry trends.\n*   **Learning & Development:**\n    *   Assist in identifying training needs across the organization.\n    *   Coordinate and facilitate training sessions and workshops.\n    *   Maintain training records and track employee development.\n\n**Required Skills and Qualifications:**\n\n*   Bachelor's degree in Human Resources, Business Administration, or a related field.\n*   1-3 years of experience in a HR generalist or administrative role.\n*   Strong understanding of HR principles and best practices.\n*   Excellent communication, interpersonal, and problem-solving skills.\n*   Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).\n*   Ability to maintain confidentiality and handle sensitive information with discretion.\n*   Strong organizational skills and attention to detail.\n*   Ability to work independently and as part of a team.\n*   Familiarity with HRIS systems.\n\n**Preferred Qualifications:**\n\n*   Experience with HRIS systems (e.g., BambooHR, Zoho People).\n*   Knowledge of Indian labor laws and regulations.\n*   Experience in a fast-paced, startup environment.\n*   Prior experience in the media or entertainment industry.\n*   Certification in Human Resources (e.g., SHRM-CP, HRCI-PHR).\n*   Fluency in one or more Indian languages relevant to STAGE’s content (Haryanvi, Rajasthani, Bhojpuri).\n\n**Education Requirements:**\n\n*   Bachelor’s degree in Human Resources, Business Administration, or related field.\n\n**Additional Requirements/Benefits:**\n\n*   Competitive salary and benefits package.\n*   Opportunity to work in a dynamic and growing company.\n*   Exposure to all aspects of HR in a fast-paced environment.\n*   Be part of a company preserving and promoting regional culture.\n*   Health Insurance\n*   Paid Time Off\n"
    }
  }
]