[
  {
    "id": 1747392699264,
    "role": "Sr. Frontend Dev",
    "yearsOfExperience": "5+",
    "jobDescription": "**Sr. Frontend Developer**\n\n**About STAGE:**\n\nSTAGE is an entertainment platform for regional cultures, founded in 2019. We are known for producing premium quality content in Indian languages to reinforce, protect, and validate people's sense of identity for their culture and heritage. We currently focus on Haryanvi, Rajasthani, and Bhojpuri languages. Our mobile apps have 15 Mn+ downloads and 4 Mn+ paying customers globally, making STAGE the biggest media platform in these regions. As seen on Shark Tank India S2, STAGE is revolutionizing regional entertainment.\n\n**Job Overview:**\n\nSTAGE is seeking a highly skilled and experienced Sr. Frontend Developer to join our dynamic engineering team. You will be responsible for developing and maintaining the user interface of our web and mobile applications, ensuring a seamless and engaging user experience for our millions of users. You will play a key role in shaping the future of our platform, working on challenging and impactful projects that contribute to STAGE's mission of celebrating and preserving regional cultures.\n\n**Key Responsibilities:**\n\n*   Develop and maintain high-quality, scalable, and maintainable frontend code using modern JavaScript frameworks (e.g., React, Angular, Vue.js).\n*   Collaborate with product managers, designers, and backend engineers to translate user stories and designs into functional and visually appealing user interfaces.\n*   Write unit and integration tests to ensure code quality and reliability.\n*   Participate in code reviews to provide constructive feedback and ensure adherence to coding standards.\n*   Optimize frontend performance for speed and scalability.\n*   Troubleshoot and debug frontend issues across different browsers and devices.\n*   Stay up-to-date with the latest frontend technologies and trends.\n*   Contribute to the development of our frontend architecture and best practices.\n*   Mentor and guide junior frontend developers.\n*   Participate in sprint planning, daily stand-ups, and retrospective meetings.\n*   Work closely with the design team to ensure the technical feasibility of UI/UX designs.\n*   Contribute to improving the overall development process and team productivity.\n\n**Required Skills and Qualifications:**\n\n*   5+ years of professional experience in frontend development.\n*   Strong proficiency in JavaScript, HTML, and CSS.\n*   Experience with modern JavaScript frameworks such as React (preferred), Angular, or Vue.js.\n*   Experience with state management libraries (e.g., Redux, MobX, Context API).\n*   Experience with testing frameworks (e.g., Jest, Mocha, Cypress).\n*   Experience with responsive design and cross-browser compatibility.\n*   Experience with RESTful APIs and data fetching.\n*   Experience with version control systems (e.g., Git).\n*   Solid understanding of frontend architecture and design patterns.\n*   Strong problem-solving and debugging skills.\n*   Excellent communication and collaboration skills.\n*   Ability to work independently and as part of a team.\n*   Passion for building high-quality user interfaces.\n\n**Preferred Qualifications:**\n\n*   Experience with TypeScript.\n*   Experience with server-side rendering (SSR).\n*   Experience with mobile development (React Native, Flutter, or Native).\n*   Experience with performance optimization techniques.\n*   Experience with CI/CD pipelines.\n*   Experience with GraphQL.\n*   Knowledge of accessibility best practices (WCAG).\n*   Familiarity with the entertainment industry and/or regional Indian cultures.\n*   Experience working in an Agile development environment.\n\n**Education Requirements:**\n\n*   Bachelor's degree in Computer Science or a related field, or equivalent practical experience.\n\n**Additional Requirements and Benefits:**\n\n*   Competitive salary and benefits package.\n*   Opportunity to work on challenging and impactful projects.\n*   Collaborative and supportive work environment.\n*   Opportunity to learn and grow your skills.\n*   Be a part of a team revolutionizing regional entertainment for millions of users.\n*   Health insurance\n*   Paid Time Off\n*   Flexible working hours\n",
    "createdAt": "2025-05-16T10:51:39.264Z",
    "status": "OPEN"
  },
  {
    "id": 1747397171543,
    "role": "Sr Design ",
    "yearsOfExperience": "1-3",
    "jobDescription": "**Sr. Design Associate**\n\n**About STAGE:**\n\nSTAGE is an entertainment platform for regional cultures, started in 2019. We are known for producing premium quality content in Indian languages to reinforce, protect, and validate people’s sense of identity for their culture and heritage. Currently focusing on Haryanvi, Rajasthani, and Bhojpuri languages, our mobile apps have garnered over 15 million downloads and 4 million paying customers globally, making STAGE the biggest media platform in these regions. STAGE was also featured on Shark Tank India S2 in 2023.\n\n**Job Overview:**\n\nSTAGE is seeking a passionate and talented Sr. Design Associate to join our growing design team. You will play a key role in shaping the visual identity and user experience across our platform, working on a variety of projects from mobile app interfaces to marketing materials. This is an excellent opportunity to contribute to a dynamic and culturally relevant platform while honing your design skills.\n\n**Key Responsibilities:**\n\n*   **Visual Design:** Conceptualize and create visually appealing and engaging designs for our mobile applications (iOS & Android) and other digital platforms.\n*   **UI/UX Design:** Contribute to the design and improvement of user interfaces and user experiences, ensuring intuitive navigation and a seamless user journey.\n*   **Brand Consistency:** Maintain and evolve the STAGE brand guidelines, ensuring consistency across all design materials.\n*   **Collaboration:** Collaborate closely with product managers, engineers, and marketing teams to translate project requirements into effective design solutions.\n*   **Graphic Design:** Design marketing collateral, including social media graphics, website banners, and print materials.\n*   **Design Systems:** Contribute to the development and maintenance of our design system, ensuring scalability and consistency.\n*   **User Research & Testing:** Participate in user research and usability testing to inform design decisions.\n*   **Stay Updated:** Keep abreast of the latest design trends, tools, and technologies.\n*   **Project Management:** Manage multiple design projects simultaneously, ensuring timely delivery and adherence to project timelines.\n\n**Required Skills and Qualifications:**\n\n*   1-3 years of experience in a design role, preferably in a product or digital environment.\n*   Strong portfolio showcasing a range of design skills, including visual design, UI/UX design, and graphic design.\n*   Proficiency in design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign), Figma, or Sketch.\n*   Understanding of UI/UX principles and best practices for mobile and web design.\n*   Solid understanding of typography, color theory, and layout principles.\n*   Excellent communication and collaboration skills.\n*   Ability to work independently and as part of a team.\n*   Strong attention to detail and a commitment to quality.\n*   A passion for design and a desire to learn and grow.\n\n**Preferred Qualifications:**\n\n*   Experience working on mobile applications (iOS and Android).\n*   Experience with motion graphics and animation.\n*   Familiarity with design systems and component libraries.\n*   Understanding of user research methodologies.\n*   Experience with A/B testing.\n*   Knowledge of Hindi and/or other Indian languages.\n*   Experience with video editing software.\n\n**Education Requirements:**\n\n*   Bachelor’s degree in Design, Visual Communication, or a related field.\n\n**Additional Requirements & Benefits:**\n\n*   Must be willing to work from our office location (to be specified during interview).\n*   Competitive salary and benefits package.\n*   Opportunity to work on a culturally significant platform.\n*   Dynamic and collaborative work environment.\n*   Opportunities for professional development and growth.\n",
    "createdAt": "2025-05-16T12:06:11.543Z",
    "status": "OPEN"
  },
  {
    "id": 1747401719114,
    "role": "HR ",
    "yearsOfExperience": "1-3",
    "jobDescription": "**Job Title: HR Associate**\n\n**Overview:**\n\nSTAGE, a leading entertainment platform dedicated to showcasing and preserving regional cultures through premium content in Indian languages, is seeking a motivated and detail-oriented HR Associate to join our growing team. This role is ideal for an early-career HR professional with 1-3 years of experience looking to contribute to a dynamic and mission-driven organization. As the HR Associate, you will provide support across a range of HR functions, playing a vital role in ensuring a positive and productive employee experience.\n\n**Key Responsibilities:**\n\n*   **Recruitment & Onboarding:**\n    *   Assist with the full-cycle recruitment process, including posting job descriptions, screening resumes, coordinating interviews, and conducting reference checks.\n    *   Manage the onboarding process for new hires, including preparing onboarding materials, conducting orientation sessions, and ensuring a smooth transition into the company.\n*   **Employee Relations:**\n    *   Provide support to employees regarding HR policies, procedures, and benefits.\n    *   Assist with resolving employee relations issues and conducting investigations as needed.\n    *   Maintain confidential employee records and ensure data accuracy.\n*   **HR Administration:**\n    *   Administer HR-related documentation, such as employment contracts, performance reviews, and termination paperwork.\n    *   Manage employee attendance, leave records, and other HR databases.\n    *   Assist with benefits administration, including enrollment, changes, and terminations.\n*   **Performance Management:**\n    *   Support the performance review process by providing guidance to managers and employees.\n    *   Track performance metrics and identify areas for improvement.\n*   **HR Projects:**\n    *   Participate in HR projects aimed at improving HR processes and employee engagement.\n    *   Conduct research on best practices in HR and make recommendations for implementation.\n*   **Compliance:**\n    *   Ensure compliance with all applicable labor laws and regulations.\n    *   Maintain up-to-date knowledge of HR best practices and industry trends.\n*   **Learning & Development:**\n    *   Assist in identifying training needs across the organization.\n    *   Coordinate and facilitate training sessions and workshops.\n    *   Maintain training records and track employee development.\n\n**Required Skills and Qualifications:**\n\n*   Bachelor's degree in Human Resources, Business Administration, or a related field.\n*   1-3 years of experience in a HR generalist or administrative role.\n*   Strong understanding of HR principles and best practices.\n*   Excellent communication, interpersonal, and problem-solving skills.\n*   Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).\n*   Ability to maintain confidentiality and handle sensitive information with discretion.\n*   Strong organizational skills and attention to detail.\n*   Ability to work independently and as part of a team.\n*   Familiarity with HRIS systems.\n\n**Preferred Qualifications:**\n\n*   Experience with HRIS systems (e.g., BambooHR, Zoho People).\n*   Knowledge of Indian labor laws and regulations.\n*   Experience in a fast-paced, startup environment.\n*   Prior experience in the media or entertainment industry.\n*   Certification in Human Resources (e.g., SHRM-CP, HRCI-PHR).\n*   Fluency in one or more Indian languages relevant to STAGE’s content (Haryanvi, Rajasthani, Bhojpuri).\n\n**Education Requirements:**\n\n*   Bachelor’s degree in Human Resources, Business Administration, or related field.\n\n**Additional Requirements/Benefits:**\n\n*   Competitive salary and benefits package.\n*   Opportunity to work in a dynamic and growing company.\n*   Exposure to all aspects of HR in a fast-paced environment.\n*   Be part of a company preserving and promoting regional culture.\n*   Health Insurance\n*   Paid Time Off\n",
    "createdAt": "2025-05-16T13:21:59.114Z",
    "status": "OPEN"
  }
]